Tekla Open API Reference for Tekla Structures 2025
ComponentItem.Type Property
 The component item's type.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ComponentItem.ComponentTypeEnum Type { get; set; }
Public Property Type As ComponentItem.ComponentTypeEnum
	Get
	Set
Property Value
Type: ComponentItem.ComponentTypeEnum
See Also
Reference
ComponentItem Class
Tekla.Structures.Catalogs Namespace